// emoji-characters.js
module.exports = {
	a: 'A', b: 'B', c: 'C', d: 'D',
	e: 'E', f: 'F', g: 'G', h: 'H',
	i: 'I', j: 'J', k: 'K', l: 'L',
	m: 'M', n: 'N', o: 'O', p: 'P',
	q: 'Q', r: 'R', s: 'S', t: 'T',
	u: 'U', v: 'V', w: 'W', x: 'X',
	y: 'Y', z: 'Z', 0: 'O', 1: '1',
	2: '2', 3: '3', 4: '4', 5: '5',
	6: '6', 7: '7', 8: '8', 9: '9',
	10: '🔟', '#': '#', '*': '*',
	'!': '❗', '?': '❓', bar: '🍫', pong: '🏓',
	up: '👍', down: '👎', comment: '💬', meme: '🤣',
	prayer: '🙏', info: '📰', quote: '📙', 
	media: '📷', mission: '⛪', speech: '🗣️',
	reddit: '(∩ ͡° ͜ʖ ͡°)⊃━☆ ─=≡Σ'
};