{
	"jokes": [
		"Unfortunately these jokes only work if you git them.",
		"I've got a great UDP joke but I'm afraid you wouldn't get it...",
		"A programmer was arrested for writing unreadable code. They refused to comment.",
		"There are 10 types of people in this world, those who understand binary and those who don't.",
		"I’ve been hearing news about this big boolean.\n\nHuge if true.",
		"A programmer's significant other tells them, 'Run to the store and pick up a loaf of bread. If they have eggs, get a dozen.'\n\nThe programmer comes home with 12 loaves of bread.",
		"Java truly is an OOP language...\n\nAs in: OOPs I used Java!",
		"The next time you're using Safari or Firefox and it's running slowly, you can say to yourself, '[I could've had a V8](https://www.youtube.com/watch?v=ld8eAH0MW00)'.",
		"Asynchronous JavaScript is amazing.\n\nI Promise you, await and see.",
		"A new database query walks into a bar.\n\nThe server says 'Sorry, cache only.'",
		"**Q:** How do you get the code for the bank vault?\n\n**A:** You checkout their branch.",
		"**Q:** How did the developer announce their engagement?\n\n**A:** They 'return'ed 'true'!",
		"**Q:** Why did the security conscious engineer refuse to pay their dinner bill?\n\n**A:** Because they could not verify the checksum.",
		"**Q:** What do you call a busy waiter?\n\n**A:** A server.",
		"**Q:** What do you call an idle server?\n\n**A:** A waiter.",
		"[Please Enter New Password]\n\nfortnight\n\n[Error: Password is Two Week]",
		"**Q:** How many Prolog programmers does it take to change a lightbulb?\n\n**A:** Yes.",
		"**Q:** What diet did the ghost developer go on?\n\n**A:** Boolean",
		"**Q:** Why was the developer unhappy at their job?\n\n**A:** They wanted arrays.",
		"**Q:** Why did 10 get paid less than '10'?\n\n**A:** There was workplace inequality.",
		"**Q:** Why was the function sad after a successful first call?\n\n**A:** It didn’t get a callback.",
		"**Q:** Why did the angry function exceed the callstack size?\n\n**A:** It got into an Argument with itself",
		"**Q:** Whats the object-oriented way to become wealthy?\n\n**A:** Inheritance",
		"**Q:** Why did the developer ground their kid?\n\n**A:** They weren't telling the truthy",
		"**Q:** What did the array say after it was extended?\n\n**A:** Stop objectifying me.",
		"**!false**\n\nIt's funny 'cause it's true.",
		"**Q:** Where did the parallel function wash its hands?\n\n**A:** Async",
		"**Q:** I'm starting a band called HTML Encoder\n\n**A:** Looking to buy a guitar",
		"**Q:** Why did the functions stop calling each other?\n\n**A:** Because they had constant arguments.",
		"**Q:** What's the second movie about a database engineer called?\n\n**A:** The SQL.",
		"**Q:** Why doesn't Hollywood make more Big Data movies?\n\n**A:** NoSQL.",
		"**Q:** What did the spider do on the computer?\n\n**A:** Made a website!",
		"**Q:** What did the computer do at lunchtime?\n\n**A:** Had a byte!",
		"**Q:** What does a baby computer call his father?\n\n**A:** Data!",
		"**Q:** Why did the computer keep sneezing?\n\n**A:** It had a virus!",
		"**Q:** What is a computer virus?\n\n**A:** A terminal illness!",
		"**Q:** Why was the computer freezing?\n\n**A:** It left its Windows open!",
		"**Q:** Why was there a bug in the computer?\n\n**A:** Because it was looking for a byte to eat?",
		"**Q:** Why did the computer squeak?\n\n**A:** Because someone stepped on its mouse!",
		"**Q:** What do you get when you cross a computer and a life guard?\n\n**A:** A screensaver!",
		"**Q:** Where do all the cool mice live?\n\n**A:** In their mousepads!",
		"**Q:** What do you get when you cross a computer with an elephant?\n\n**A:** Lots of memory!",
		"**Q:** How do programming pirates pass method parameters?\n\n**A:** Varrrrarrrgs.",
		"**Q:** How do programming shepherds count their flock?\n\n**A:** With lambda functions",
		"**Q:** What airline do developers prefer when they're in a rush?\n\n**A:** Delta.",
		"**Q:** How did pirates collaborate before computers?\n\n**A:** Pier to pier networking.",
		"**Q:** Why don't bachelors like Git?\n\n**A:** Because they are afraid to commit.",
		"**Q:** A SQL query goes into a bar, walks up to two tables and asks:\n\n**A:** Can I JOIN you?",
		"**Q:** How does a developer make a cheer?\n\n**A:** ['hip','hip'] // (hip hip array!)",
		"**Q:** Why was the developer's family upset with them at dinner?\n\n**A:** They forgot to git squash before going home",
		"**Q:** What did JavaScript call his son?\n\n**A:** JSON!",
		"**Q:** What did the proud React component say to its child?\n\n**A:** I've got to give you props",
		"**Q:** What did the server say to his client who was having a bad day?\n\n**A:** Everything's going to be 200",
		"**Q:** Why did the developer go broke?\n\n**A:** Because they used up all their cache",
		"**Q:** Are computers dangerous?\n\n**A:** Nah, they don't byte. They just nibble a bit.",
		"**Q:** How did the mafioso kill the Node server?\n\n**A:** Tie await to it and let it async.",
		"**Q:** You know what the best thing about booleans is?\n\n**A:** Even if you are wrong, you are only off by a bit.",
		"**Q:** Why couldn’t the user update a file on a shared server?\n\n**A:** They didn’t have the write permissions",
		"**Q:** What do you do when you can't understand your husband's behavior?\n\n**A:** man man",
		"**Q:** How many developers does it take to change a light bulb?\n\n**A:** None. It's a hardware issue",
		"**Q:** Why do programmers always mix up Halloween and Christmas?\n\n**A:** Because 31 OCT == 25 DEC",
		"**Q:** Why do kayakers make bad programmers?\n\n**A:** Because they're afraid of waterfall.",
		"**Q:** What are computers' favorite snacks?\n\n**A:** Microchips, phish sticks, and cookies. But just a few bytes of each.",
		"**Q:** What do computers love to do at the beach?\n\n**A:** Put on some spam block for protection so they can safely surf the net while catching some .WAVs!",
		"**Q:** What's a compiler developer's favorite spice?\n\n**A:** Parsley.",
		"**Q:** A SQL developer walked into a NoSQL bar.\n\n**A:** They left because they couldn't find a table.",
		"**Q:** How do you help JS errors?\n\n**A:** You 'console' them!",
		"**Q:** Why don't parents teach their kids about regular expressions?\n\n**A:** Because they don't want them playing with matches",
		"**Q:** Why didn't the '<div />' get invited to the dinner party?\n\n**A:** Because it had no class!",
		"**Q:** Why did the constant break up with the variable?\n\n**A:** Because they changed.",
		"**Q:** Why did the database administrator leave his wife?\n\n**A:** She had one-to-many relationships.",
		"**Q:** What did the Class say in court when put on trial?\n\n**A:** I strongly object!",
		"**Q:** Why do Java developers wear glasses?\n\n**A:** Because they don't C#!",
		"**Q:** What are the three hardest problems in computer science?\n\n**A:** Naming things and off-by-one errors",
		"**Q:** What did the fruit basket say to the developer?\n\n**A:** I hope you're ready for some pear programming!",
		"**Q:** I love you and I only love you. Does that turn you on?\n\n**AND GATE:** No.",
		"**Q:** Why do all HTML emails get blocked?\n\n**A:** Because they are all '<span />'.",
		"**Q:** What did the process say after working in an infinite loop all day?\n\n**A:** I need a break.",
		"**Q:** An Agent died unexpectedly. How was the crime solved?\n\n**A:** By looking at the Stack Trace.",
		"**Q:** Why did the document store go out of business?\n\n**A:** It had NoSQL.",
		"**Q:** Why can't SQL and NoSQL Developers date one other?\n\n**A:** Because they don't agree on relationships.",
		"**Q:** Why is Python like the Soviet Union?\n\n**A:** Because it has no private fields",
		"**Q:** Where did the API go to eat?\n\n**A:** To the RESTaurant",
		"**Q:** Why shouldn't you trust Matlab developers?\n\n**A:** Because they're always plotting something.",
		"**Q:** Why did the developer have to quit smoking?\n\n**A:** Because they couldn't afford to pay the new syntax.",
		"**Q:** How does a programmer open a jar for their significant other?\n\n**A:** They install Java",
		"**Q:** What did the psychic say to the developers?\n\n**A:** I see dev people.",
		"**Q:** Where does the pirate stash all of their digital treasures?\n\n**A:** RAR",
		"**Q:** What is React's favorite movie genre?\n\n**A:** Suspense",
		"**Q:** Why couldn't the React component understand the joke?\n\n**A:** Because it didn't get the context.",
		"**Q:** What did XHR say to AJAX when it thought it was being a Mean Girl?\n\n**A:** Stop trying to make fetch happen!",
		"**Q:** What was Grace Hopper's favorite car?\n\n**A:** VW Bug",
		"**Q:** What sits on a pirate's shoulder and calls, 'Pieces of seven, Pieces of seven'?\n\n**A:** Parroty error.",
		"**Q:** What is a pirate's favorite programming language?\n\n**A:** You'd think it was R, but a pirate's first love is Objectively C.",
		"**Q:** Why did the programmer come home crying?'\n\n**A:** His friends were always boolean him.",
		"**-** Knock Knock!\n\n**-** An async function\n\n**-** Who's there?",
		"**Q:** What PostgreSQL library should Python developers use for adult-oriented code?\n\n**A:** psycoPG13",
		"**Q:** What accommodations did the JavaScript developer request at the hotel?\n\n**A:** A room with a Vue.",
		"**Q:** Where do developers drink?\n\n**A:** The Foo bar",
		"**Q:** Why do assembly programmers need to know how to swim?\n\n**A:** Because they work below C level.",
		"**Q:** Who used the internet before it was cool?\n\n**A:** Httpsters",
		"**Q:** What kind of computer can hold a musical note?\n\n**A:** A Dell.",
		"**Q:** Why did the web developer always go to the wrong hotel room?\n\n**A:** They were in room 301.",
		"**Q:** How do you stop a web developer stealing your stuff?\n\n**A:** Write 403 on it.",
		"**Q:** Why are machine learning models so fit?\n\n**A:** Because they do weight training.",
		"**Q:** Why did Gargamel shut down the internet?\n\n**A:** Because he didn't want people **SMURFING** the web!",
		"**Q:** What did the command line die of?\n\n**A**: A Terminal illness.",
		"**Q:** Did you hear what the clumsy cryptographer did to their password?\n\n**A**: Made a hash of it.",
		"**Q:** Why are keyboards always working so hard?\n\n**A**: Cause they have two shifts!",
		"**Q:** What are clouds made of?\n\n**A**: Mostly linux servers.",
		"**Q:** How does Mr. Potato Head (dev edition 0.0.1) remove his mustache?\n\n**A**: git stache pop",
		"**Q:** Why can't you use 'Soup' as your password?\n\n**A**: Because it isn't 'stroganoff'",
		"**Q:** Why do developers use mechanical keyboards?\n\n**A**: To strongly type their code.",
		"**Q:** What's the best tool for automatically ignoring long email threads about tech buzzwords?\n\n**A**: 'Block-chain'",
		"**Q:** What is a developer's favorite country song?\n\n**A**: Hello World - by Lady Antebellum",
		"**Q:** Why was nobody given food at the developer conference?\n\n**A**: It was a serverless function!",
		"**Q:** Why did the developer cancel their dinner plans?\n\n**A**: They were unable to fulfil peer dependencies",
		"**Q:** Why did the functional programmer finally move out of their house?\n\n**A**: For(e) closure",
		"**Q:** How do JavaScript developers break up?\n\n**A:** They always promise to callback",
		"**Q:** Why do developers mixup Terminals and Polygraphs?\n\n**A:** Because they both can see a lie (CLI)",
		"**Q:** Did you hear about the programmer that was scared of IDEs?\n\n**A:** They retreated back into their shell",
		"Do not take life too seriously. You will never get out of it alive.",
		"If you haven't got anything nice to say about anybody, come sit next to me.",
		"One advantage of talking to yourself is that you know at least somebody's listening.",
		"Everything is funny, as long as it's happening to somebody else.",
		"It's simple, if it jiggles, it's fat.",
		"They say marriages are made in Heaven.\n\nBut so is thunder and lightning.",
		"There are only three things women need in life: food, water, and compliments.",
		"If con is the opposite of pro, then isn’t Congress the opposite of progress?",
		"**Q:** How do you know that you have been in college too long?\n\n**A:** Your parents are running out of money!",
		"**Q:** Why did the sun skip college?\n\n**A:** It already has a million degrees.",
		"**Q:** What did the buffalo say to his son when he left for college?\n\n**A:** Bi-son.",
		"**Q:** If pilgrims traveled on the Mayflower, what do college students travel on?\n\n**A:** Scholar-ships.",
		"College student: Hey, Dad — I've got some great news for you!\n\nFather: What, son?\n\nCollege student: Remember that $500 you promised me if I made the Dean’s list?\n\nFather: I certainly do.\n\nCollege student: Well, you get to keep it!",
		"Professor: Why do pimples make horrible prisoners?\n\nBecause they keep breaking out!",
		"A new student at Harvard stopped an upperclassman and asked, Where’s the library at?\n\nThe upperclassman said, Never end a sentence with a preposition. Cops do it on TV, but it isn't proper, so to speak.\n\nThe new student said, Pardon me. Where’s the library at, MORON?",
		"A history professor and a psychology professor were sitting outside at a nudist colony.\n\n\nThe history professor asked: “Have you read Marx?”\n\nThe psychology professor replied: Yes. I think it’s from the wicker chairs.",
		"**Q:** What do you call hiking U.S. college students?\n\n**A:** The walking debt.",
		"My local college has a program that lets students earn their tuition by working in the on-campus bakery.\n\nThe opportunity isn’t open to everyone.\n\nIt’s run on a strictly knead to know basis.",
		"I think college athletes should get paid to play sports.\n\nExcept Tennessee. They’re Volunteers.",
		"When I told my family I graduated from clown college…\n\nThey all laughed at me.",
		"Employer: Forget everything you learned in college. You won’t need it working here.\n\nPotential employee: I never went to college.\n\nEmployer: Oh, sorry. Unfortunately, you’re not qualified to work here.",
		"Two high school graduates are discussing their future college plans.\n\nThe first says, I'm planning on going into farming. It's what my father did and it makes good money.\n\nThe second asks, What type of farming? Wheat, corn, livestock?\n\nI don’t know, man; there are so many fields to choose from, the third responds.\n\nA buddy of mine went to college, majored in veterinary medicine and minored in taxidermy.\n\nEither way you’re getting your dog back, he says.",
		"**Q:** What is a Gen Z’ers favorite college?\n\n**A:** Juuliard.",
		"**Q:** What do you call a test tube with a college degree?\n\n**A:** A graduated cylinder.",
		"My wife was disappointed to find out the real reason why my nickname in college was The Love Machine.\n\nIt's because I sucked at tennis.",
		"In college, I was so broke I couldn’t pay the electricity bill.\n\nThose were the darkest days of my life.",
		"My old girlfriend wanted me to do her college algebra homework for her.\n\nBut frankly, I didn’t want to solve for ex.",
		"A college professor was very worried about his recent study on earthquakes.\n\nIt turns out his findings were on shaky ground.",
		"My dad told me that colleges are cracking down on ghost-written essays?\n\nI asked, What about mummy-written essays?",
		"**Q:** Why did the music note drop out of college?\n\n**A:** Because it couldn’t pick a major.",
		"**Q:** What did Chuck Norris tell his father when he left for college?\n\n**A:** You’re the man of the house now.",
		"The dean of a college told the auditorium, The female dormitory will be out-of-bounds for all male students, so too the male dormitory to female students. Anybody caught breaking this rule will be fined $20 the first time. Anybody caught breaking this rule the second time will be fined $60. Being caught a third time will incur a hefty fine of $180.\n\nAre there any questions?\n\nAt this, a student in the crowd raised their hand and asked, Er… how much for a season pass?",
		"**Q:** How many graduate students does it take to change a lightbulb?\n\n**A:** Only one, but it may take them more than five years to do it.",
		"You dies of natural causes.",
        "You dies from bad succ.",
        "You dies from dabbing too hard.",
        "You dies from posting normie memes.",
        "You dies from disrespecting wahmen.",
		"You dies from watching the emoji movie and enjoying it.",
		"You dies because they used a bobby pin to lift their eyelashes",
        "You dies because they were just too angry.",
        "You decided it was a good idea to fight a tiger while smelling like meat. It did not end well.",
        "You disappeared from the universe.",
        "You drank some toxic soda before it was recalled.",
		"You dies of starvation.",
		"You died because RemindMeBot forgot to remind them to breathe",
        "You died due to eating WAY too many hotdogs in preparation for their date Friday night.",
        "You got into a knife fight with the pope. One of them is in hell now.",
        "You died from swallowing rocks too fast",
        "You accidentally clicked on a popup ad that reads \"Doctors hate us, see the one best trick for dying today!\"",
        "You died from ebola.",
        "You fell into a pit of angry feminists.",
        "You died from drinking too much water Huh, I guess it IS possible!.",
		"You died while playing hopscotch on *seemingly* deactivated land mines.",
		"You talked back to mods and got destroyed by the ban hammer.",
        "You died after trying to out-meme Dank Memer.",
        "You died from eating too much bread :/",
        "You died an honorable death. Death by snoo snoo.",
        "You tried to get famous on YouTube by live-streaming something dumb. Skydiving while chained to a fridge.",
        "You was walking normally when out of the corner of their eye they saw someone do a bottle flip and dab causing You to have a stroke.",
        "You died from eating cactus needles.",
        "You died after playing with an edgy razor blade fidget spinner.",
        "You drowned in their own tears.",
        "You died eating expired and infected raw fish with the filthiest rice in the world as sushi while being constantly stabbed in the scrotum with a 9inch nail sharp enough to stab through kevlar. The soy sauce was cat piss.",
        "You died of oversucc",
        "You accidentally tripped and died while getting up to write their suicide note.",
        "You died from whacking it too much. (There's a healthy balance, boys)",
		"You died from not whacking it enough. (There's a healthy balance, boys)",
		"You loses the will to live",
        "You dies from dabbing too hard",
        "You died from a tragic amount of bad succ",
        "You dies by swearing on a Christian Minecraft server",
        "You died. OOF",
        "You died while listening to 'It's every day bro'",
        "You died while trying to find the city of England",
        "You died from a high salt intake",
        "You died due to being so stupid",
        "You died from reposting in the wrong neighborhood",
        "You died when testing a hydrogen bomb. There is nothing left to bury.",
        "You died from meme underdose :/",
        "You dies from severe dislike of sand. It's coarse and rough and irritating it gets everywhere"
	]
}